app/views/staffs/_form.html.erb

SELECT 1 FROM `staffs` WHERE (`staffs`.`userid` = BINARY 'huynhut12222') AND (`staffs`.id <> 31) LIMIT 1
---
  </div>
  <% if session[:userid] != nil and Staff.find_by_userid(session[:userid]).userid == 'admin' %>