app/views/staffs/_search_results.html.erb

      <th></th>
      <% if session[:userid] != nil and Staff.find_by_userid(session[:userid]).userid == 'admin' %>
---
SELECT `staffs`.* FROM `staffs` WHERE (created_at IS NOT NULL AND UPPER(userid) LIKE '%ADMIN%') ORDER BY userid desc