app/views/shoots/index.html.erb


   <%= text_field_with_auto_complete :story, :name ,:value => params[:story] ? params[:story][:name] : (Story.find_by_id(session[:story_id]) ? Story.find_by_id(session[:story_id]).name : '') %>
---
SELECT `stories`.* FROM `stories` WHERE `stories`.`id` = 1 LIMIT 1