app/views/home/index.html.erb

<p id="notice"><%= notice %></p>
<% if session[:userid] == nil or Staff.find_by_userid(session[:userid]) == nil %>
---
SELECT `staffs`.* FROM `staffs` WHERE `staffs`.`userid` = 'huynhut' LIMIT 1