app/views/stories/_search_results.html.erb

      <% end %>
      <% if session[:userid] != nil and Staff.find_by_userid(session[:userid]).userid == 'admin' %>
---
SELECT `staffs`.* FROM `staffs` WHERE `staffs`.`userid` = 'admin' LIMIT 1