app/views/stories/show.html.erb

      <% end %>
      <% if session[:userid] != nil or Staff.find_by_userid(session[:userid]).userid == 'admin' %>
---
SELECT `staffs`.* FROM `staffs` WHERE `staffs`.`userid` = 'huynhut' LIMIT 1