app/views/characters/index.html.erb

SELECT `stories`.* FROM `stories` WHERE `stories`.`id` = 1 LIMIT 1
---
      </td><td>
        <%= text_field_with_auto_complete :story, :name ,:value => params[:story] ? params[:story][:name] : (Story.find_by_id(session[:story_id]) ? Story.find_by_id(session[:story_id]).name : '') %>