app/views/webextras/_search_results.html.erb

SELECT `staffs`.* FROM `staffs` WHERE `staffs`.`userid` = 'admin' LIMIT 1
---
      <% end %>
      <% if session[:userid] != nil and Staff.find_by_userid(session[:userid]).userid == 'admin' %>