app/controllers/airdates_controller.rb

SELECT `stories`.* FROM `stories` WHERE `stories`.`id` IS NULL LIMIT 1
SELECT `staffs`.* FROM `staffs` WHERE (userid = 'admin' ) LIMIT 1
---
  def index
    @story = Story.find_by_id(session[:story_id])
    if @story == nil
      redirect_to :controller => 'stories' ,:action => 'index'
      return
    end
    if session[:userid] != nil and session[:userid] != ''
      @valid_staff = Staff.find(:first, :conditions => ["userid = ? ", session[:userid]])

SELECT `airdates`.* FROM `airdates` WHERE `airdates`.`id` = 1 LIMIT 1
SELECT `staffs`.* FROM `staffs` WHERE (userid = 'admin' ) LIMIT 1
---
  def show
    @airdate = Airdate.find(params[:id])
    if session[:userid] != nil and session[:userid] != ''
      @valid_staff = Staff.find(:first, :conditions => ["userid = ? ", session[:userid]])

SELECT `airdates`.* FROM `airdates` WHERE `airdates`.`id` = 1 LIMIT 1
---
  def edit
    @airdate = Airdate.find(params[:id])

INSERT INTO `airdates` (`airdate`, `story_id`, `created_at`, `updated_at`) VALUES ('2011-04-29', NULL, '2011-04-29 06:30:28', '2011-04-29 06:30:28')
---
  def create
    @airdate = Airdate.new(params[:airdate])
    @airdate.story_id = session[:story_id]
    respond_to do |format|
      if @airdate.save

SELECT 1 FROM `airdates` WHERE (`airdates`.`airdate` = '2011-04-29') AND (`airdates`.id <> 1) LIMIT 1
UPDATE `airdates` SET `airdate` = '2011-08-29 07:37:00', `updated_at` = '2011-04-29 07:37:31' WHERE `airdates`.`id` = 4
---
  def update
    @airdate = Airdate.find(params[:id])

    respond_to do |format|
      if @airdate.update_attributes(params[:airdate])