app/controllers/characters_controller.rb

SELECT `stories`.* FROM `stories` WHERE `stories`.`id` = 1 LIMIT 1
SELECT `staffs`.* FROM `staffs` WHERE `staffs`.`userid` = 'huynhut' LIMIT 1
---
  def index
    @story = Story.find_by_id(session[:story_id])
    if @story == nil
      redirect_to :controller => 'stories' ,:action => 'index'
      return
    end
    if session[:userid] != nil and session[:userid] != ''
      @valid_staff = Staff.find(:first, :conditions => ["userid = ? ", session[:userid]])

SELECT `characters`.* FROM `characters` WHERE (story_id = 1 AND UPPER(salutation) LIKE '%A%' AND UPPER(address) LIKE '%A%') ORDER BY salutation desc
---
      end
    end
    conditions[:story_id] = @story.id
    @characters = Character.where("story_id = :story_id" + query_string, conditions).find(:all ,:order => sort_order).paginate :page => params[:page],:per_page => params[:character] ? params[:character][:record_number] : 10

SELECT `characters`.* FROM `characters` WHERE `characters`.`id` = 1 LIMIT 1
SELECT `staffs`.* FROM `staffs` WHERE (userid = 'admin' ) LIMIT 1
---
  def show
    @character = Character.find(params[:id])
    if session[:userid] != nil and session[:userid] != ''
      @valid_staff = Staff.find(:first, :conditions => ["userid = ? ", session[:userid]])

SELECT `characters`.* FROM `characters` WHERE `characters`.`id` = 1 LIMIT 1
---
  def edit
    @character = Character.find(params[:id])

INSERT INTO `characters` (`salutation`, `first_name`, `last_name`, `address`, `city`, `state`, `zip`, `phone_1`, `phone_2`, `phone_3`, `email_1`, `email_2`, `notes`, `avatar`, `rep_phone`, `rep_email`, `representative`, `rep_address`, `story_id`, `created_at`, `updated_at`) VALUES ('22', '222', '2222', '222', '222', '22', '22', '', '', '', '', '', NULL, NULL, '', 'nhut2020@yahoo.com', '', '', 1, '2011-05-24 18:17:43', '2011-05-24 18:17:43')
---
  def create
    @character = Character.new(params[:character])
    @character.story_id = session[:story_id]
    respond_to do |format|
      if @character.save

SELECT `characters`.* FROM `characters` WHERE `characters`.`id` = 1 LIMIT 1
---
  def update
    @character = Character.find(params[:id])