app/controllers/home_controller.rb

  def index
    if session[:userid]
      @valid_staff = Staff.find(:first, :conditions => ["userid = ? ", session[:userid]])
---
SELECT `staffs`.* FROM `staffs` WHERE `staffs`.`userid` = 'huynhut' LIMIT 1

  def complete_sign_in_google
    # logger.info 'aa'
    client = GData::Client::DocList.new
    client.authsub_token = params[:token] # extract the single-use token from the URL query params
    session[:token] = client.auth_handler.upgrade()
    client.authsub_token = session[:token] if session[:token]
    #logger.info client.auth_handler.info
    # redirect_to '/'
    logger.info feed = client.get('http://www.google.com/m8/feeds/contacts/default/full?max-results=0').to_xml


    logger.info feed.elements['title'].text
    logger.info feed.elements['author'].elements['name'].text
    logger.info feed.elements['author'].elements['email'].text
    if feed and  params[:token]
      if feed.elements['author'] and feed.elements['author'].elements['email'].text
        @staff_email = Staff.find_by_email(feed.elements['author'].elements['email'].text)
        @staff_userid = Staff.find_by_userid(feed.elements['author'].elements['email'].text)
---
SELECT `staffs`.* FROM `staffs` WHERE `staffs`.`email` = 'nguyenhuynhutsimple@gmail.com' LIMIT 1
SELECT `staffs`.* FROM `staffs` WHERE `staffs`.`userid` = 'nguyenhuynhutsimple@gmail.com' LIMIT 1

            password = ''
            6.times { |i| password << chars[rand(chars.length)] }
            @staff = Staff.new(:userid => feed.elements['author'].elements['email'].text, :email => feed.elements['author'].elements['email'].text , :token => params[:token], :password => password ,:first_name => feed.elements['author'].elements['name'].text, :last_name => '-' , :title => feed.elements['title'].text ,:phone => '-')
            if @staff.save()
---
INSERT INTO `staffs` (`userid`, `password`, `first_name`, `last_name`, `email`, `title`, `avatar`, `phone`, `token`, `is_senior_producer`, `is_assignment_editor`, `is_producer`, `created_at`, `updated_at`) VALUES ('nguyenhuynhutsimple@gmail.com', 'cf6e5058b913fd51b1e8ed767e1eb015c1593d9c', 'Huy Nhut', '-', 'nguyenhuynhutsimple@gmail.com', 'Huy Nhut\'s Contacts', NULL, '-', '1/3NZdrSnNshQMF0xwMthVmNpwx1rrglwzvRqNiuzDqxI', NULL, NULL, NULL, '2011-05-02 04:33:56', '2011-05-02 04:33:56')