app/controllers/shoots_controller.rb

SELECT `stories`.* FROM `stories` WHERE `stories`.`id` IS NULL LIMIT 1
SELECT `staffs`.* FROM `staffs` WHERE `staffs`.`userid` = 'admin' LIMIT 1
SELECT `shoots`.* FROM `shoots` WHERE (story_id = 1 AND UPPER(crew_requirements) LIKE '%A%') ORDER BY date desc
---
  def index
    @story = Story.find_by_id(session[:story_id])
    if @story == nil
      redirect_to :controller => 'stories' ,:action => 'index'
      return
    end
    if session[:userid] != nil and session[:userid] != ''
      @valid_staff = Staff.find(:first, :conditions => ["userid = ? ", session[:userid]])
    end
    query_string = ""
    conditions = {}
    if params[:shoot]
      if params[:shoot][:crew_requirements] != nil and params[:shoot][:crew_requirements] != ''
        query_string = query_string + " AND UPPER(crew_requirements) LIKE :crew_requirements"
        conditions[:crew_requirements] = "%" + params[:shoot][:crew_requirements].strip.upcase + "%"
      end
      if params[:shoot][:location] != nil and params[:shoot][:location] != ''
        query_string = query_string + " AND UPPER(location) LIKE :location"
        conditions[:location] = "%" + params[:shoot][:location].strip.upcase + "%"
      end
      if params[:shoot][:cameraperson_id] != nil and params[:shoot][:cameraperson_id] != ''
        query_string = query_string + " AND cameraperson_id = :cameraperson_id"
        conditions[:cameraperson_id] = params[:shoot][:cameraperson_id]
      end
    end
    conditions[:story_id] = @story.id
    logger.info params[:shoot]
    @shoots = Shoot.where("story_id = :story_id" + query_string, conditions).find(:all ,:order => sort_order).paginate :page => params[:page],:per_page => params[:shoot] ? params[:shoot][:record_number] : 10

SELECT `shoots`.* FROM `shoots` WHERE `shoots`.`id` = 1 LIMIT 1
---
  def show
    @shoot = Shoot.find(params[:id])

SELECT `staffs`.* FROM `staffs` WHERE `staffs`.`userid` = 'nguyenhuynhutsimple@gmail.com' LIMIT 1
---
  def new
    @shoot = Shoot.new
    if session[:userid] != nil and session[:userid] != ''
      @valid_staff = Staff.find(:first, :conditions => ["userid = ? ", session[:userid]])

SELECT `staffs`.* FROM `staffs` WHERE (userid = 'huynhut' ) LIMIT 1
SELECT `shoots`.* FROM `shoots` WHERE `shoots`.`id` = 11 LIMIT 1
---
  def edit
    if session[:userid] != nil and session[:userid] != ''
      @valid_staff = Staff.find(:first, :conditions => ["userid = ? ", session[:userid]])
    end
    @shoot = Shoot.find(params[:id])

SELECT `staffs`.* FROM `staffs` WHERE (userid = 'huynhut' ) LIMIT 1
INSERT INTO `shoots` (`date`, `crew_requirements`, `location`, `senior_approval`, `assigned`, `notes`, `preshow_tease`, `check_mail`, `cameraperson_id`, `approver_id`, `story_id`, `staff_id`, `created_at`, `updated_at`) VALUES ('2011-05-25', '222', '22', NULL, NULL, '22', '', 0, 1, NULL, 3, 2, '2011-05-25 18:10:10', '2011-05-25 18:10:10')
---
  def create
    @shoot = Shoot.new(params[:shoot])
    @shoot.story_id = session[:story_id]
    @shoot.check_mail = false
    if session[:userid] != nil and session[:userid] != ''
      @valid_staff = Staff.find(:first, :conditions => ["userid = ? ", session[:userid]])
      if  params[:shoot][:senior_approval] == '1'
        @shoot.approver = @valid_staff
      end
      @shoot.staff = @valid_staff
    end
    respond_to do |format|
      if @shoot.save

SELECT `shoots`.* FROM `shoots` WHERE `shoots`.`id` = 11 LIMIT 1
SELECT `staffs`.* FROM `staffs` WHERE (userid = 'huynhut' ) LIMIT 1
UPDATE `shoots` SET `cameraperson_id` = 1, `preshow_tease` = 'adsfadfd', `updated_at` = '2011-04-29 03:56:15' WHERE `shoots`.`id` = 11
---
  def update
    @shoot = Shoot.find(params[:id])
    if session[:userid] != nil and session[:userid] != ''
      @valid_staff = Staff.find(:first, :conditions => ["userid = ? ", session[:userid]])
      if params[:shoot][:senior_approval] == '1'
        @shoot.approver = @valid_staff
      end
      @shoot.staff = @valid_staff
    end
    params[:shoot][:check_mail] = false
    respond_to do |format|
      if @shoot.update_attributes(params[:shoot])

SELECT `shoots`.* FROM `shoots` WHERE `shoots`.`id` = 4 LIMIT 1
DELETE FROM `shoots` WHERE `shoots`.`id` = 4
---
  def destroy
    @shoot = Shoot.find(params[:id])
    @shoot.destroy