app/controllers/staffs_controller.rb

SELECT `staffs`.* FROM `staffs` WHERE (created_at IS NOT NULL AND UPPER(first_name) LIKE '%A%') ORDER BY userid desc
---
  def index
    query_string = ""
    conditions = {}
    if params[:staff]
      if params[:staff][:userid] != nil and params[:staff][:userid] != ''
        query_string = query_string + " AND UPPER(userid) LIKE :userid"
        conditions[:userid] = "%" + params[:staff][:userid].strip.upcase + "%"
      end
      if params[:staff][:first_name] != nil and params[:staff][:first_name] != ''
        query_string = query_string + " AND UPPER(first_name) LIKE :first_name"
        conditions[:first_name] = "%" + params[:staff][:first_name].strip.upcase + "%"
      end
      if params[:staff][:last_name] != nil and params[:staff][:last_name] != ''
        query_string = query_string + " AND UPPER(last_name) LIKE :last_name"
        conditions[:last_name] = "%" + params[:staff][:last_name].strip.upcase + "%"
      end
      if params[:staff][:email] != nil and params[:staff][:email] != ''
        query_string = query_string + " AND UPPER(email) LIKE :email"
        conditions[:email] = "%" + params[:staff][:email].strip.upcase + "%"
      end
      if params[:staff][:title] != nil and params[:staff][:title] != ''
        query_string = query_string + " AND UPPER(title) LIKE :title"
        conditions[:title] = "%" + params[:staff][:title].strip.upcase + "%"
      end
      if params[:staff][:phone] != nil and params[:staff][:phone] != ''
        query_string = query_string + " AND UPPER(phone) LIKE :phone"
        conditions[:phone] = "%" + params[:staff][:phone].strip.upcase + "%"
      end
    end
    @staffs =  Staff.where("created_at IS NOT NULL" + query_string, conditions).find(:all ,:order => sort_order).paginate :page => params[:page],:per_page => params[:staff] ? params[:staff][:record_number] : 10

SELECT `staffs`.* FROM `staffs` WHERE `staffs`.`id` = 1 LIMIT 1
---
  def show
    @staff = Staff.find(params[:id])

SELECT `staffs`.* FROM `staffs` WHERE (userid = 'nguyenhuynhutsimple@gmail.com' ) LIMIT 1
SELECT `staffs`.* FROM `staffs` WHERE `staffs`.`userid` = 'huynhut' LIMIT 1
---
  def edit

    @staff = Staff.find(params[:id])
    if session[:userid] != nil and session[:userid] != ''
      if session[:userid] != 'admin'

        @valid_staff = Staff.find(:first, :conditions => ["userid = ? ", session[:userid]])

INSERT INTO `staffs` (`userid`, `password`, `first_name`, `last_name`, `email`, `title`, `avatar`, `phone`, `token`, `is_senior_producer`, `is_assignment_editor`, `is_producer`, `created_at`, `updated_at`) VALUES ('huynhut', '7c4a8d09ca3762af61e59520943dc26494f8941b', 'Huy Nhut', 'Nguyen', 'nhut2020@yahoo.com', 'Developer', NULL, '23343', NULL, 1, 1, 0, '2011-05-02 04:52:40', '2011-05-02 04:52:40')
---
  def create
    @staff = Staff.new(params[:staff])

    respond_to do |format|
      if @staff.save

SELECT `staffs`.* FROM `staffs` WHERE `staffs`.`id` = 31 LIMIT 1
UPDATE `staffs` SET `last_name` = 'ba', `phone` = '2244', `is_senior_producer` = 1, `is_assignment_editor` = 1, `is_producer` = 1, `updated_at` = '2011-05-02 04:45:16' WHERE `staffs`.`id` = 2
---
  def update
    @staff = Staff.find(params[:id])

    respond_to do |format|
      if @staff.update_attributes(params[:staff])

SELECT `staffs`.* FROM `staffs` WHERE (userid = 'nhut2020@yahoo.com' and password = 'eb47448dde6fd39ecf05e3d337ddbcf31d93effe') LIMIT 1
---
  def authenticate

    @staff = Staff.new(params[:staff_form])
    #find records with userid,password
    valid_user = Staff.find(:first, :conditions => ["userid = ? and password = ?", @staff.userid, Digest::SHA1.hexdigest(@staff.password)])

SELECT `staffs`.* FROM `staffs` WHERE (userid = 'admin' ) LIMIT 1
---
  def send_contact_staff
    respond_to do |format|
      if verify_recaptcha( :message => "Oh! It's error with reCAPTCHA!")
        subject = params[:contact_staff][:subject]
        staff = Staff.find_by_id(params[:contact_staff][:id].to_i)

SELECT `staffs`.* FROM `staffs` WHERE (userid = 'huynhut' ) LIMIT 1
---
  def send_contact_us

    respond_to do |format|
      if verify_recaptcha( :message => "Oh! It's error with reCAPTCHA!")
        recipient = 'nhut2020@yahoo.com'
        subject = params[:contact_us][:subject]
        staff = Staff.find(:first, :conditions => ["userid = ? ", session[:userid]])

SELECT 1 FROM `staffs` WHERE (`staffs`.`email` = BINARY 'nhut2020@yahoo.com') AND (`staffs`.id <> 32) LIMIT 1
UPDATE `staffs` SET `password` = '3e7057b5b176afb21d07c611ec1717aded626bc3', `updated_at` = '2011-04-28 09:14:16' WHERE `staffs`.`id` = 32
---
  def sendmail
    recipient = params[:mailform][:email]
    subject = 'Get your password'
    staff = Staff.find(:first, :conditions => ["email = ? ", recipient])
    chars = 'abcdefghjkmnpqrstuvwxyzABCDEFGHJKLMNOPQRSTUVWXYZ23456789'
    password = ''
    6.times { |i| password << chars[rand(chars.length)] }

    if staff
      staff.password = password
      UserMailer.forgot(recipient, subject, staff).deliver
      staff.update_attributes(:password => password)