app/controllers/stories_controller.rb

  def index
    if params[:story]
      if params[:story][:approved] == '1'
        session[:approved] = true
      else
        session[:approved] = false
      end
    else
      session[:approved] = false
    end
    if session[:userid] != nil and session[:userid] != ''
      @valid_staff = Staff.find(:first, :conditions => ["userid = ? ", session[:userid]])
---
SELECT `staffs`.* FROM `staffs` WHERE (userid = 'nguyenhuynhutsimple@gmail.com' ) LIMIT 1

      conditions[:approved] = false
    end
    conditions[:today] = Date.today()
    @stories = Story.where("approved = :approved and deadline >= :today" + query_string, conditions).find(:all ,:order => sort_order).paginate :page => params[:page],:per_page => params[:story] ? params[:story][:record_number] : 10
---
SELECT `stories`.* FROM `stories` WHERE (approved = 1 AND UPPER(graphics_collateral) LIKE '%A%' AND UPPER(script) LIKE '%22%') ORDER BY name desc

  def show
    @story = Story.find(params[:id])
    session[:story_id] = params[:id]
    @shoots = Shoot.where("story_id = :story_id" , :story_id => session[:story_id] ).find(:all ,:order => 'created_at', :limit => 20)
    @webextras = Webextra.where("story_id = :story_id" , :story_id => session[:story_id] ).find(:all ,:order => 'created_at', :limit => 20)
    @characters = Character.where("story_id = :story_id", :story_id => session[:story_id] ).find(:all ,:order => 'created_at', :limit => 20)
    @airdates = Airdate.where("story_id = :story_id", :story_id => session[:story_id] ).find(:all ,:order => 'created_at', :limit => 20)
    if session[:userid] != nil and session[:userid] != ''
      @valid_staff = Staff.find(:first, :conditions => ["userid = ? ", session[:userid]])
---
SELECT `stories`.* FROM `stories` WHERE `stories`.`id` = 1 LIMIT 1
SELECT `shoots`.* FROM `shoots` WHERE (story_id = :story_id) ORDER BY created_at LIMIT 1
SELECT `webextras`.* FROM `webextras` WHERE (story_id = '1') ORDER BY created_at LIMIT 20
SELECT `characters`.* FROM `characters` WHERE (story_id = '1') ORDER BY created_at LIMIT 20
SELECT `airdates`.* FROM `airdates` WHERE (story_id = '1') ORDER BY created_at LIMIT 20
SELECT `staffs`.* FROM `staffs` WHERE `staffs`.`userid` = 'huynhut' LIMIT 1

  def new

    @story = Story.new
    if session[:userid] != nil and session[:userid] != ''
      @valid_staff = Staff.find(:first, :conditions => ["userid = ? ", session[:userid]])
---
SELECT `staffs`.* FROM `staffs` WHERE `staffs`.`userid` = 'nguyenhuynhutsimple@gmail.com' LIMIT 1

  def edit
    @story = Story.find(params[:id])
    if session[:userid] != nil and session[:userid] != ''
      @valid_staff = Staff.find(:first, :conditions => ["userid = ? ", session[:userid]])
---
SELECT `stories`.* FROM `stories` WHERE `stories`.`id` = 3 LIMIT 1
SELECT `staffs`.* FROM `staffs` WHERE `staffs`.`userid` = 'admin' LIMIT 1

  def create
    @story = Story.new(params[:story])
    if session[:userid] != nil and session[:userid] != ''
      @valid_staff = Staff.find(:first, :conditions => ["userid = ? ", session[:userid]])
    end
    @story.approved = session[:approved]
    @story.check_mail = false
    @story.staff_id = @valid_staff.id
    respond_to do |format|
      if @story.save
---
SELECT `staffs`.* FROM `staffs` WHERE (userid = 'huynhut' ) LIMIT 1
INSERT INTO `stories` (`name`, `outline`, `graphics_collateral`, `script`, `deadline`, `check`, `approved`, `producer_id`, `correspondent_id`, `staff_id`, `editor_id`, `created_at`, `updated_at`) VALUES ('22', '222', '22', '22', '2011-05-25', 0, 1, 1, 1, 1, 1, '2011-05-25 03:10:49', '2011-05-25 03:10:49')

  def update
    @story = Story.find(params[:id])
    if session[:userid] != nil and session[:userid] != ''
      @valid_staff = Staff.find(:first, :conditions => ["userid = ? ", session[:userid]])
    end
    params[:story][:check_mail] = false
    @story.staff_id = @valid_staff.id
    respond_to do |format|
      if @story.update_attributes(params[:story])
---
SELECT `stories`.* FROM `stories` WHERE `stories`.`id` = 3 LIMIT 1
SELECT `staffs`.* FROM `staffs` WHERE (userid = 'admin' ) LIMIT 1
UPDATE `stories` SET `script` = 'http://w3school.com', `updated_at` = '2011-05-09 07:35:53' WHERE `stories`.`id` = 4