app/controllers/webextras_controller.rb

  def index
    if session[:userid] != nil and session[:userid] != ''
      @valid_staff = Staff.find(:first, :conditions => ["userid = ? ", session[:userid]])
    end
    query_string = ""
    conditions = {}
    if params[:story]
      if params[:story][:name] != nil and params[:story][:name].strip != ''
        story = Story.find_by_name(params[:story][:name].strip)
        if story
          query_string = query_string + " AND  story_id = :story_id"
          conditions[:story_id] = story.id
        end
      end
    end
    if params[:webextra]
      if params[:webextra][:title] != nil and params[:webextra][:title] != ''
        query_string = query_string + " AND UPPER(title) LIKE :title"
        conditions[:title] = "%" + params[:webextra][:title].strip.upcase + "%"
      end
      if params[:webextra][:summary] != nil and params[:webextra][:summary] != ''
        query_string = query_string + " AND UPPER(summary) LIKE :summary"
        conditions[:summary] = "%" + params[:webextra][:summary].strip.upcase + "%"
      end
      if params[:webextra][:name] != nil and params[:webextra][:name] != ''
        query_string = query_string + " AND UPPER(name) LIKE :name"
        conditions[:name] = "%" + params[:webextra][:name].strip.upcase + "%"
      end
    else
      if Story.find_by_id(session[:story_id])
---
SELECT `staffs`.* FROM `staffs` WHERE `staffs`.`userid` = 'huynhut' LIMIT 1
SELECT `stories`.* FROM `stories` WHERE `stories`.`id` IS NULL LIMIT 1

        conditions[:story_id] = session[:story_id]
      end
    end
    @webextras = Webextra.where("created_at IS NOT NULL" + query_string, conditions).find(:all ,:order => sort_order).paginate :page => params[:page],:per_page => params[:webextra] ? params[:webextra][:record_number] : 10
---
SELECT `webextras`.* FROM `webextras` WHERE (story_id = 1 AND UPPER(title) LIKE '%A%' AND UPPER(summary) LIKE '%B%') ORDER BY title desc

  def show
    @webextra = Webextra.find(params[:id])
---
SELECT `webextras`.* FROM `webextras` WHERE `webextras`.`id` = 1 LIMIT 1

  def edit
    @webextra = Webextra.find(params[:id])
---
SELECT `webextras`.* FROM `webextras` WHERE `webextras`.`id` = 9 LIMIT 1

  def create
    @webextra = Webextra.new(params[:webextra])
    @webextra.check_mail = false
    if session[:userid] != nil and session[:userid] != ''
      @valid_staff = Staff.find(:first, :conditions => ["userid = ? ", session[:userid]])
    end
    @webextra.staff_id = @valid_staff.id
    if params[:story]
      if params[:story][:name] != nil and params[:story][:name].strip != ''
        story = Story.find_by_name(params[:story][:name].strip)
        if story

          @webextra.story_id = story.id
        end
      end
    end
    respond_to do |format|
      if @webextra.save
        begin
          if params[:video] and params[:video].original_filename
            extension = File.extname(params[:video].original_filename)
            file_name = @webextra.id.to_s + '_' + Time.now.to_i.to_s
            AWS::S3::S3Object.store(sanitize_filename(file_name + extension), params[:video].read, BUCKET, :access => :public_read)
            @webextra.update_attribute('videourl' ,AWS::S3::S3Object.url_for(file_name + extension, BUCKET, :authenticated => false))

          end
        rescue
          @webextra.delete
---
SELECT `staffs`.* FROM `staffs` WHERE (userid = 'nguyenhuynhutsimple@gmail.com' ) LIMIT 1
INSERT INTO `webextras` (`title`, `summary`, `videourl`, `story_id`, `created_at`, `updated_at`) VALUES ('s', 'df', 'http://s3.amazonaws.com/en_shootsheet_test/snookerpup_fhnom3b7.mp4', NULL, '2011-05-02 16:46:57', '2011-05-02 16:46:57')
DELETE FROM `webextras` WHERE `webextras`.`id` = 6

  def update
    @webextra = Webextra.find(params[:id])
    params[:webextra][:check_mail] = false
    if session[:userid] != nil and session[:userid] != ''
      @valid_staff = Staff.find(:first, :conditions => ["userid = ? ", session[:userid]])
    end
    @webextra.staff_id = @valid_staff.id
    if params[:story]
      if params[:story][:name] != nil and params[:story][:name].strip != ''
        story = Story.find_by_name(params[:story][:name].strip)
        if story

          @webextra.story_id = story.id
        end
      else
        @webextra.story_id = nil
      end
    end
    respond_to do |format|
      if @webextra.update_attributes(params[:webextra])
---
SELECT `webextras`.* FROM `webextras` WHERE `webextras`.`id` = 9 LIMIT 1
UPDATE `webextras` SET `videourl` = 'http://s3.amazonaws.com/en_shootsheet_test/9_1304395003.mp4', `updated_at` = '2011-05-03 03:56:47' WHERE `webextras`.`id` = 9